app/Controllers/Factura.php

INSERT INTO `factura` (`id_cliente`, `fecha`, `estatus`) VALUES ('2', '2024-05-02', 1)
---
    public function registro(){
        $datos['id_cliente'] = isset($_POST['clientes']) ? addslashes(trim($_POST['clientes'])) : "";
        $datos['fecha'] = isset($_POST['fecha']) ? addslashes(trim($_POST['fecha'])) : "";
        $datos['estatus'] = 1;


            $result = $this->facturaModel->insert($datos);