app/Models/clientesModel.php

    function leyendoCliente(){
        $db = \Config\Database::connect();
            $builder = $db->table('cliente');
            $builder->select("*");
            $builder->where('estatus', 1);
            $query = $builder->get();
---
SELECT *
FROM `cliente`
WHERE `estatus` = 1

    function deletedata($data){
        $db = \Config\Database::connect();
        $builder = $db->table('cliente');
        $builder->where('id_cliente', $data["id_cliente"]);
        $result = $builder->update($data);
---
UPDATE `cliente` SET `id_cliente` = '10', `estatus` = 0
WHERE `id_cliente` = '10'

    function seleccionandoCliente(){
        $db = \Config\Database::connect();
            $builder = $db->table('cliente');
            $builder->select("id_cliente, nombre");
            $builder->where('estatus', 1);
            $query = $builder->get();
---
SELECT `id_cliente`, `nombre`
FROM `cliente`
WHERE `estatus` = 1