app/Models/facturasModel.php

    function leyendoFactura(){
        $db = \Config\Database::connect();
            $builder = $db->table('factura');
            $builder->select("num_factura, cliente.id_cliente, nombre , fecha");
            $builder->where('factura.estatus', 1);
            $builder->join('cliente', 'factura.id_cliente = cliente.id_cliente');
            $query = $builder->get();
---
SELECT `num_factura`, `cliente`.`id_cliente`, `nombre`, `fecha`
FROM `factura`
JOIN `cliente` ON `factura`.`id_cliente` = `cliente`.`id_cliente`
WHERE `factura`.`estatus` = 1