app/Models/productosModel.php

    function leyendoProducto(){
        $db = \Config\Database::connect();
            $builder = $db->table('producto');
            $builder->select("*");
            $builder->where('estatus', 1);
            $query = $builder->get();
---
SELECT *
FROM `producto`
WHERE `estatus` = 1